{"config": {"name": "sequential_3", "layers": [{"config": {"dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv3d_3", "strides": [1, 1, 1], "use_bias": true, "batch_input_shape": [null, 32, 32, 32, 1], "trainable": true, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "filters": 32, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv3D"}, {"config": {"dtype": "float32", "name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dtype": "float32", "trainable": true, "padding": "valid", "pool_size": [2, 2, 2], "name": "max_pooling3d_2", "data_format": "channels_last", "strides": [2, 2, 2]}, "class_name": "MaxPooling3D"}, {"config": {"dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv3d_4", "strides": [1, 1, 1], "use_bias": true, "trainable": true, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "filters": 32, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv3D"}, {"config": {"dtype": "float32", "name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv3d_5", "strides": [1, 1, 1], "use_bias": true, "trainable": true, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "filters": 32, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv3D"}, {"config": {"dtype": "float32", "trainable": true, "padding": "valid", "pool_size": [2, 2, 2], "name": "max_pooling3d_3", "data_format": "channels_last", "strides": [2, 2, 2]}, "class_name": "MaxPooling3D"}, {"config": {"dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "name": "dropout_2", "rate": 0.8}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "name": "flatten_3", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "units": 2048, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"dtype": "float32", "epsilon": 0.001, "beta_constraint": null, "momentum": 0.99, "axis": -1, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_regularizer": null, "center": true, "trainable": true, "gamma_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization"}, {"config": {"dtype": "float32", "units": 2, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_6", "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax"}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.3.1", "class_name": "Sequential"}