{"config": {"layers": [{"config": {"name": "conv2d_1", "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_regularizer": null, "batch_input_shape": [null, 32, 32, 32], "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "conv2d_3", "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "filters": 64, "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true, "seed": null, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_2", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"units": 2048, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "use_bias": true, "name": "dense_3", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "trainable": true, "center": true, "axis": -1, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "name": "batch_normalization_1", "dtype": "float32", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"units": 2, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "use_bias": true, "name": "dense_4", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Dense"}], "name": "sequential_2"}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Sequential"}