{"config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv3d_1", "strides": [2, 2, 2], "use_bias": true, "batch_input_shape": [null, 32, 32, 32, 1], "trainable": true, "padding": "valid", "bias_constraint": null, "kernel_size": [5, 5, 5], "dilation_rate": [1, 1, 1], "filters": 32, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv3D"}, {"config": {"alpha": 0.10000000149011612, "dtype": "float32", "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv3d_2", "strides": [1, 1, 1], "use_bias": true, "trainable": true, "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3, 3], "dilation_rate": [1, 1, 1], "filters": 32, "activity_regularizer": null, "activation": "linear", "kernel_constraint": null}, "class_name": "Conv3D"}, {"config": {"alpha": 0.10000000149011612, "dtype": "float32", "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"dtype": "float32", "trainable": true, "padding": "valid", "pool_size": [2, 2, 2], "name": "max_pooling3d_1", "data_format": "channels_last", "strides": [2, 2, 2]}, "class_name": "MaxPooling3D"}, {"config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "units": 128, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "linear"}, "class_name": "Dense"}, {"config": {"dtype": "float32", "units": 2, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "softmax"}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.3.1", "class_name": "Sequential"}