{"config": {"layers": [{"config": {"name": "conv3d_1", "strides": [2, 2, 2], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [5, 5, 5], "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_regularizer": null, "batch_input_shape": [null, 32, 32, 32, 1], "dilation_rate": [1, 1, 1], "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv3D"}, {"config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612, "dtype": "float32"}, "class_name": "LeakyReLU"}, {"config": {"name": "conv3d_2", "strides": [1, 1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3, 3], "bias_constraint": null, "activation": "linear", "data_format": "channels_last", "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv3D"}, {"config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612, "dtype": "float32"}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2, 2], "data_format": "channels_last", "name": "max_pooling3d_1", "strides": [2, 2, 2], "trainable": true, "dtype": "float32", "padding": "valid"}, "class_name": "MaxPooling3D"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"units": 128, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "use_bias": true, "name": "dense_1", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"units": 2, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "use_bias": true, "name": "dense_2", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "dtype": "float32"}, "class_name": "Dense"}], "name": "sequential_1"}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Sequential"}